## plan
```diff
+ Green
- Red
! Orange
@@ Pink @@
#Gray
module.complete.random_id.this: Refreshing state... [id=nw]
data.http.my_public_ip: Reading...
module.complete.data.http.my_public_ip: Reading...
module.key-pair.tls_private_key.this[0]: Refreshing state... [id=de6a860a4dcda3a5eb59e01a9b5769a6baae2cce]
module.complete.data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
module.complete.data.aws_region.current: Reading...
data.aws_region.current: Reading...
data.aws_availability_zones.available: Reading...
module.complete.aws_secretsmanager_secret.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-csbcSG]
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-FCjPtK]
module.complete.data.aws_iam_policy_document.trust_relationship: Reading...
module.complete.data.aws_iam_policy_document.trust_relationship: Read complete after 0s [id=1903849331]
module.key-pair.aws_key_pair.this[0]: Refreshing state... [id=sophos]
module.complete.data.aws_ami_ids.sfos: Reading...
data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.data.aws_availability_zones.available: Reading...
module.complete.aws_secretsmanager_secret.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-surhIF]
module.complete.data.aws_caller_identity.current: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
data.aws_availability_zone.available["us-west-1c"]: Reading...
data.aws_availability_zone.available["us-west-1b"]: Reading...
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-FCjPtK|236BBC2C-1FE9-4C87-8724-1CE918E533CD]
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Reading...
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Read complete after 0s [id=1403001165]
module.complete.data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
module.complete.aws_secretsmanager_secret_version.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-csbcSG|15FBF0AA-0A51-42BC-B7EA-BE52601FEAF0]
module.complete.data.template_file.user_data: Reading...
module.complete.data.template_file.user_data: Read complete after 0s [id=d89bf3e3524f920c6b5fcbb91469b770bb189b86c5c99b22797763ed28238efd]
module.complete.aws_secretsmanager_secret_version.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-surhIF|81A1EF2B-EBC1-47F8-BBAF-9A42CB69FE9A]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Reading...
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Read complete after 0s [id=1150620253]
data.aws_availability_zone.available["us-west-1b"]: Read complete after 0s [id=us-west-1b]
data.aws_availability_zone.available["us-west-1c"]: Read complete after 0s [id=us-west-1c]
module.complete.data.aws_ami_ids.sfos: Read complete after 0s [id=1726762986]
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Read complete after 1s [id=ami-053dbe57dfe422765]
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Read complete after 1s [id=ami-07186848dc5aa7580]
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Read complete after 1s [id=ami-0434af33056d1e189]
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Read complete after 1s [id=ami-030bf19f87a227c8a]
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Read complete after 1s [id=ami-059bf44c0f5e904d9]
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Read complete after 1s [id=ami-0f37b9b5182756d01]
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Read complete after 1s [id=ami-0442ca42ae7162b75]
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Read complete after 1s [id=ami-0028214389e81fc39]
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Read complete after 1s [id=ami-091558582143f9648]
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Read complete after 0s [id=ami-04b0be28f678af9ee]
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Read complete after 0s [id=ami-026c32ba32c93b8c4]
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Read complete after 0s [id=ami-03cbb6f8e3173ca7a]
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Read complete after 0s [id=ami-0eafce265f8e28d06]
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Read complete after 0s [id=ami-0b68236d144f48351]
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Read complete after 0s [id=ami-065fabeba927f04d3]
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Read complete after 0s [id=ami-0fb2a8cf2684fdb0c]
module.complete.data.aws_caller_identity.current: Read complete after 1s [id=447552758530]
module.complete.aws_vpc.this[0]: Refreshing state... [id=vpc-05c3a6486d8423317]
module.complete.aws_iam_role.this: Refreshing state... [id=ec2-iam-role-SOPHOS_CNF-9f-447552758530]
module.complete.aws_subnet.private[0]: Refreshing state... [id=subnet-0340dd983f39eb13d]
module.complete.aws_security_group.public[0]: Refreshing state... [id=sg-055bc443b1c17d1dd]
module.complete.aws_security_group.trusted[0]: Refreshing state... [id=sg-019a534c1d6b045db]
module.complete.aws_subnet.public[0]: Refreshing state... [id=subnet-0c3b7899c39c061c3]
module.complete.aws_route_table.private[0]: Refreshing state... [id=rtb-0c623699acc193f9a]
module.complete.aws_internet_gateway.this[0]: Refreshing state... [id=igw-000fe3e5361f5ad52]
module.complete.aws_route_table.public[0]: Refreshing state... [id=rtb-0659cdd807deda852]
module.complete.aws_security_group.lan[0]: Refreshing state... [id=sg-05eb7267770073cc4]
module.complete.aws_route_table_association.public: Refreshing state... [id=rtbassoc-0b81de8c564ee810d]
module.complete.aws_route.public: Refreshing state... [id=r-rtb-0659cdd807deda8521080289494]
module.complete.aws_network_interface.public: Refreshing state... [id=eni-06f53b9273fe28699]
module.complete.aws_network_interface.private: Refreshing state... [id=eni-07b354ed3fd4188db]
module.complete.aws_route_table_association.private: Refreshing state... [id=rtbassoc-0e48bae4327472a5c]
module.complete.aws_route.private: Refreshing state... [id=r-rtb-0c623699acc193f9a1080289494]
module.complete.aws_eip.this[0]: Refreshing state... [id=eipalloc-0e0d7706f111c3dec]
module.complete.aws_iam_instance_profile.this: Refreshing state... [id=ec2-instance-profile-SOPHOS_CNF-9f]
module.complete.aws_launch_template.this: Refreshing state... [id=lt-0f19ec93dd62c3b18]
module.complete.aws_instance.this: Refreshing state... [id=i-04e6477b5f6eb2040]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place

Terraform will perform the following actions:

  # module.complete.aws_eip.this[0] will be updated in-place
  ~ resource "aws_eip" "this" {
        id                        = "eipalloc-0e0d7706f111c3dec"
      ~ tags                      = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.complete.aws_iam_instance_profile.this will be updated in-place
  ~ resource "aws_iam_instance_profile" "this" {
        id          = "ec2-instance-profile-SOPHOS_CNF-9f"
        name        = "ec2-instance-profile-SOPHOS_CNF-9f"
      ~ tags        = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all    = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
        id                    = "ec2-iam-role-SOPHOS_CNF-9f-447552758530"
        name                  = "ec2-iam-role-SOPHOS_CNF-9f-447552758530"
      ~ tags                  = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all              = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.complete.aws_instance.this will be updated in-place
  ~ resource "aws_instance" "this" {
        id                                   = "i-04e6477b5f6eb2040"
      ~ source_dest_check                    = false -> true
      ~ tags                                 = {
-           "Name"          = "sophos-xg-terraform"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                             = {
-           "Name"          = "sophos-xg-terraform"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ user_data                            = "a3de359aaa9e23c1cfd44476510fa02d793629ea" -> "daf90f295fcee6c0204afbca21504f07a84b817b"
        # (28 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # module.complete.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-000fe3e5361f5ad52"
      ~ tags     = {
-           "Name"          = "igw-SOPHOS_CNF-9f-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all = {
-           "Name"          = "igw-SOPHOS_CNF-9f-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.complete.aws_lambda_function.this will be created
+   resource "aws_lambda_function" "this" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       function_name                  = "XG-Initial-Config-SOPHOS_CNF-9f"
+       handler                        = "config.main"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       memory_size                    = 128
+       package_type                   = "Zip"
+       publish                        = false
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = "lambda-role"
+       runtime                        = "python3.7"
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags_all                       = (known after apply)
+       timeout                        = 3
+       version                        = (known after apply)

+       environment {
+           variables = {
+               "CONSOLE_SECRET_NAME" = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-csbcSG"
+               "IP"                  = "10.0.1.28"
+               "PASSWORD"            = "admin"
+               "REGION_NAME"         = "us-west-1"
+               "USERNAME"            = "admin"
            }
        }

+       ephemeral_storage {
+           size = (known after apply)
        }

+       tracing_config {
+           mode = (known after apply)
        }

+       vpc_config {
+           security_group_ids = [
+               "sg-05eb7267770073cc4",
            ]
+           subnet_ids         = [
+               "subnet-0340dd983f39eb13d",
            ]
+           vpc_id             = (known after apply)
        }
    }

  # module.complete.aws_launch_template.this will be updated in-place
  ~ resource "aws_launch_template" "this" {
        id                      = "lt-0f19ec93dd62c3b18"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "launch-template-SOPHOS_CNF-9f-447552758530"
      ~ tags                    = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.complete.aws_network_interface.private will be updated in-place
  ~ resource "aws_network_interface" "private" {
        id                        = "eni-07b354ed3fd4188db"
      ~ tags                      = {
-           "Name"          = "priv-eni-SOPHOS_CNF-9f-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "Name"          = "priv-eni-SOPHOS_CNF-9f-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.complete.aws_network_interface.public will be updated in-place
  ~ resource "aws_network_interface" "public" {
        id                        = "eni-06f53b9273fe28699"
      ~ tags                      = {
-           "Name"          = "pub-eni-SOPHOS_CNF-9f-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "Name"          = "pub-eni-SOPHOS_CNF-9f-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.complete.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0c623699acc193f9a"
      ~ tags             = {
-           "Name"          = "priv-rtb-SOPHOS_CNF-9f-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all         = {
-           "Name"          = "priv-rtb-SOPHOS_CNF-9f-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0659cdd807deda852"
      ~ tags             = {
-           "Name"          = "pub-rtb-SOPHOS_CNF-9f-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all         = {
-           "Name"          = "pub-rtb-SOPHOS_CNF-9f-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.lan[0] will be updated in-place
  ~ resource "aws_security_group" "lan" {
        id                     = "sg-05eb7267770073cc4"
        name                   = "Private Subnet"
      ~ tags                   = {
-           "Name"          = "LAN"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "LAN"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.public[0] will be updated in-place
  ~ resource "aws_security_group" "public" {
        id                     = "sg-055bc443b1c17d1dd"
        name                   = "Public"
      ~ tags                   = {
-           "Name"          = "Public"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "Public"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.trusted[0] will be updated in-place
  ~ resource "aws_security_group" "trusted" {
        id                     = "sg-019a534c1d6b045db"
      ~ ingress                = [
-           {
-               cidr_blocks      = [
-                   "47.184.79.94/32",
-                   "20.165.57.171/32",
                ]
-               description      = "Allow all from trusted IP"
-               from_port        = 0
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 65535
            },
+           {
+               cidr_blocks      = [
+                   "47.184.79.94/32",
+                   "20.245.54.41/32",
                ]
+               description      = "Allow all from trusted IP"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 65535
            },
        ]
        name                   = "Trusted Network"
      ~ tags                   = {
-           "Name"          = "Trusted Network"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "Trusted Network"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.complete.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0c3b7899c39c061c3"
      ~ tags                                           = {
-           "Name"          = "public-SOPHOS_CNF-9f-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                                       = {
-           "Name"          = "public-SOPHOS_CNF-9f-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.complete.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                               = "vpc-05c3a6486d8423317"
      ~ tags                             = {
-           "Name"          = "SOPHOS_CNF-9f-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                         = {
-           "Name"          = "SOPHOS_CNF-9f-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-22-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (15 unchanged attributes hidden)
    }

Plan: 1 to add, 15 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"     
```